tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "heroku/brew"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "mongodb/brew"
tap "vitorgalvao/tiny-scripts"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# GNU binary tools for native development
brew "binutils", link: true
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Development framework for multimedia applications
brew "gstreamer"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Streaming MP3 audio server
brew "icecast"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Modular IRC client
brew "irssi"
# Audio Connection Kit
brew "jack"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Menu-driven communications program
brew "minicom"
# Run a Kubernetes cluster locally
brew "minikube"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@8"
# Minimal dumb-terminal emulation program
brew "picocom"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql"
# Sound system for POSIX OSes
brew "pulseaudio"
# Emulator for x86 and PowerPC
brew "qemu"
# QR Code generation
brew "qrencode"
# Software environment for statistical computing
brew "r"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOcket CAT: netcat on steroids
brew "socat"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Simplified and community-driven man pages
brew "tldr"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8-openj9"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Digital audio mixing application
cask "au-lab"
# Multi-track audio editor and recorder
cask "audacity"
# Two-factor authentication software
cask "authy"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web security testing toolkit
cask "burp-suite"
# Shoutcast and Icecast streaming client
cask "butt"
# Twitch chat client
cask "chatty"
# Server and cloud storage browser
cask "cyberduck"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# QuickLook generator and Spotlight importer
cask "epubquicklook"
# Web browser
cask "firefox"
# GIT client
cask "fork"
# Free and open-source image editor
cask "gimp"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Open-source video transcoder
cask "handbrake"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logitech-options"
# Cable-free audio router
cask "loopback"
# Track and update to the latest versions of installed software
cask "macupdater"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source, low-latency, high quality voice chat software for gaming
cask "mumble"
# Open-source music notation software
cask "musescore"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Open-source software for live streaming and screen recording
cask "obs"
# NewTek NDI integration for OBS Studio
cask "obs-ndi"
# Remote-control OBS Studio through WebSockets
cask "obs-websocket"
# Collaboration platform for API development
cask "postman"
cask "provisionql"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pat"
cask "quicklookapk"
cask "quicklookase"
# Archive manager for data compression and backups
cask "rar"
# Digital audio production application
cask "reaper"
# MongoDB management tool
cask "robo-3t"
# PDF reader and note-taking application
cask "skim"
# Video chat, voice call and instant messaging application
cask "skype"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Open-source BitTorrent client
cask "transmission"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Configurable document editor that supports Markdown
cask "typora"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Remote desktop application focusing on security
cask "vnc-viewer"
cask "webpquicklook"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Tureng", id: 854063979
mas "Twitter", id: 1482454543
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
