tap "argoproj/tap"
tap "buildpacks/tap"
tap "buo/cask-upgrade"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "pyroscope-io/brew"
tap "redpanda-data/tap"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# GNU binary tools for native development
brew "binutils"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Cross-platform make
brew "cmake"
# Tool for service discovery, monitoring and configuration
brew "consul"
# DNS server that chains plugins
brew "coredns"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Tool for interacting with remote images and registries
brew "crane"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Debugger for the Go programming language
brew "delve"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Cloud-native high-performance edge/middle/service proxy
brew "envoy"
# Key value store for shared configuration and service discovery
brew "etcd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Tool to list and diagnose Go processes currently running on your system
brew "gops"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Development framework for multimedia applications
brew "gstreamer"
# Reliable, high performance TCP/HTTP load balancer
brew "haproxy"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Istio configuration command-line utility
brew "istioctl"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Open-source distributed event streaming platform
brew "kafka"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Kubernetes Native Policy Management
brew "kyverno"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Next-gen compiler infrastructure
brew "llvm"
# Run LogQL queries against a Loki server
brew "logcli"
# Horizontally-scalable, highly-available log aggregation system
brew "loki"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Mock code autogenerator for Golang
brew "mockery"
# Implementation of the Vulkan graphics and compute API on top of Metal
brew "molten-vk"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Open source distributed and RESTful search engine
brew "opensearch"
# Open source visualization dashboards for OpenSearch
brew "opensearch-dashboards"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@15"
# Service monitoring system and time series database
brew "prometheus"
# Log agent for Loki
brew "promtail"
# QR Code generation
brew "qrencode"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Display and control your Android device
brew "scrcpy"
# SOcket CAT: netcat on steroids
brew "socat"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Manage code quality
brew "sonarqube"
# SOund eXchange: universal sound sample translator
brew "sox"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Tool to build, change, and version infrastructure
brew "terraform"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Modern reverse proxy
brew "traefik"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Open source continuous profiling software
brew "pyroscope-io/brew/pyroscope"
# Redpanda CLI & toolbox
brew "redpanda-data/tap/redpanda"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Digital audio mixing application
cask "au-lab"
# Multi-track audio editor and recorder
cask "audacity"
# Two-factor authentication software
cask "authy"
# Desktop password and login vault
cask "bitwarden"
# E-books management software
cask "calibre"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Distributed NoSQL cloud database
cask "couchbase-server-community"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# GIT client
cask "fork"
# Free and open-source image editor
cask "gimp"
# Tools to protect your files
cask "gpg-suite-no-mail"
cask "grid-clock"
# Open-source video transcoder
cask "handbrake"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Kubernetes IDE
cask "lens"
# NDI SDK
cask "libndi"
# Track and update to the latest versions of installed software
cask "macupdater"
# Sandbox construction video game
cask "minecraft"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source, low-latency, high quality voice chat software for gaming
cask "mumble"
# Open-source music notation software
cask "musescore"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Open-source software for live streaming and screen recording
cask "obs"
# NDI integration for OBS Studio
cask "obs-ndi"
# Replacement for Docker Desktop
cask "orbstack"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin to view patch files
cask "qlprettypatch"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Archive manager for data compression and backups
cask "rar"
# Digital audio production application
cask "reaper"
# PDF reader and note-taking application
cask "skim"
# High-quality network audio streaming
cask "sonobus"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Remote desktop application focusing on security
cask "vnc-viewer"
# QuickLook plugin for webp files
cask "webpquicklook"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025
mas "‎WhatsApp", id: 310633997
