tap "argoproj/tap"
tap "buildpacks/tap"
tap "buo/cask-upgrade"
tap "cirruslabs/cli"
tap "hashicorp/tap"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "pyroscope-io/brew"
tap "redpanda-data/tap"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# GNU binary tools for native development
brew "binutils"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Cross-platform make
brew "cmake"
# DNS server that chains plugins
brew "coredns"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Tool for interacting with remote images and registries
brew "crane"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Debugger for the Go programming language
brew "delve"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Cloud-native high-performance edge/middle/service proxy
brew "envoy"
# Key value store for shared configuration and service discovery
brew "etcd"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Tool to list and diagnose Go processes currently running on your system
brew "gops"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Reliable, high performance TCP/HTTP load balancer
brew "haproxy"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Istio configuration command-line utility
brew "istioctl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Open-source distributed event streaming platform
brew "kafka"
# Build and deploy Go applications on Kubernetes
brew "ko"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Linux virtual machines
brew "lima"
# Run LogQL queries against a Loki server
brew "logcli"
# Horizontally-scalable, highly-available log aggregation system
brew "loki"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached"
# Run a Kubernetes cluster locally
brew "minikube"
# Sign files & verify signatures. Works with signify in OpenBSD
brew "minisign"
# Implementation of the Vulkan graphics and compute API on top of Metal
brew "molten-vk"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Open source distributed and RESTful search engine
brew "opensearch"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@17"
# Service monitoring system and time series database
brew "prometheus"
# Log agent for Loki
brew "promtail"
# Generic machine emulator and virtualizer
brew "qemu"
# QR Code generation
brew "qrencode"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Display and control your Android device
brew "scrcpy"
# SOcket CAT: netcat on steroids
brew "socat"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Manage code quality
brew "sonarqube"
# Generate type safe Go from SQL
brew "sqlc"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Modern reverse proxy
brew "traefik"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# High-performance data structure server that primarily serves key/value workloads
brew "valkey"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# HTTP benchmarking tool
brew "wrk"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart"
# Consul
brew "hashicorp/tap/consul"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# Redpanda CLI & toolbox
brew "redpanda-data/tap/redpanda"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Digital audio mixing application
cask "au-lab"
# Multi-track audio editor and recorder
cask "audacity"
# Desktop password and login vault
cask "bitwarden"
# E-books management software
cask "calibre"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Distributed NoSQL cloud database
cask "couchbase-server-community"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Go (golang) IDE
cask "goland"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Open-source video transcoder
cask "handbrake"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Sandbox construction video game
cask "minecraft"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source, low-latency, high quality voice chat software for gaming
cask "mumble"
# Open-source music notation software
cask "musescore"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Open-source software for live streaming and screen recording
cask "obs"
# Replacement for Docker Desktop
cask "orbstack"
# Digital audio production application
cask "reaper"
# High-quality network audio streaming
cask "sonobus"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Affinity Photo 2", id: 1616822987
mas "Amphetamine", id: 937984704
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "‎WhatsApp", id: 310633997
